Repository: coteditor/CotEditor
Catalog: CotEditor/Localizables/Settings/SyntaxEditor.xcstrings
Source language: en
Languages: cs, de, es, fr, it, ja, ko, nl, pl, pt, ru, tr, zh_hans, zh_hant, zh_hk

source: (without dot)
cs: (bez tečky)
de: (ohne Punkt)
es: (sin punto)
fr: (sans point)
it: (senza punto)
ja: （ドット不要）
ko: (점 없이)
nl: (zonder punt)
pl: (bez kropki)
pt: (sem ponto)
ru: (без точек)
tr: (noktasız)
zh_hans: （不包括点）
zh_hant: （不包括點）
zh_hk: （不包括點）

source: %lld errors found.
cs: Bylo nalezeno %lld chyb.
de: %lld Fehler gefunden.
es: %lld errores encontrados.
fr: %lld erreurs trouvées.
it: Trovati %lld errori.
ja: %lld個のエラーが検出されました。
ko: %lld개 오류 발견됨.
nl: %lld fouten gevonden.
pl: Znaleziono %lld błędu.
pt: %lld erros encontrados.
ru: %lld ошибок найдено.
tr: %lld hata bulundu.
zh_hans: 发现%lld个错误。
zh_hant: 發現%lld個錯誤。
zh_hk: 已找到%lld個錯誤。

source: %lld items
cs: %lld položek
de: %lld Objekte
es: %lld ítems
fr: %lld éléments
it: %lld elementi
ja: %lld項目
ko: %lld개의 항목
nl: %lld onderdelen
pl: %lld rzeczy
pt: %lld itens
ru: %lld штук
tr: %lld öğe
zh_hans: %lld项
zh_hant: %lld個項目
zh_hk: %lld個項目

source: Author:
cs: Autor:
de: Autor:
es: Autor:
fr: Auteur :
it: Autore:
ja: 作者:
ko: 작성자:
nl: Auteur:
pl: Autor:
pt: Autor:
ru: Автор:
tr: Yazar:
zh_hans: 作者：
zh_hant: 作者：
zh_hk: 作者：

source: Begin String
cs: Počáteční řetězec
de: Anfangszeichenkette
es: Inicio de la cadena
fr: Début de chaîne
it: Inizio stringa
ja: 開始文字列
ko: 시작 문자열
pl: Łańcuch otwierający
pt: String Inicial
ru: Начало строки
tr: Başlangıç Dizisi
zh_hans: 起始字符串
zh_hant: 起始字串
zh_hk: 開頭字串

source: Block comment:
cs: Blokový komentář:
de: Block-Kommentar:
es: Comentario de bloque:
fr: Commentaire de bloc :
it: Commento blocco:
ja: ブロックコメント:
ko: 주석 블록:
nl: Blokcommentaar:
pl: Komentarz blokowy:
pt: Comentário em bloco:
ru: Блок комментария:
tr: Blok yorum:
zh_hans: 块注释：
zh_hant: 塊註釋：
zh_hk: 區塊註解：

source: Built-in syntaxes can’t be renamed.
cs: Předdefinované syntaxe nelze přejmenovat.
de: Integrierte Syntaxen können nicht umbenannt werden.
es: No se pueden cambiar el nombre de los paquetes de sintaxis.
fr: Les syntaxes fournies ne peuvent pas être renommées.
it: Le sintassi abbinate non possono essere rinominate.
ja: 内蔵されているシンタックスの名前は変更できません。
ko: 번들로 제공되는 구문은 이름을 바꿀 수 없습니다.
nl: Gebundelde syntaxen kunnen niet hernoemd worden.
pl: Nie można zmienić nazwy składni wbudowanej.
pt: Não é possível renomear pacotes de sintaxe.
ru: Связанные синтаксисы не могут быть переименованы.
tr: Uygulama ile gelen sözdizimler yeniden adlandırılamaz.
zh_hans: 内置语法的名称不能改变。
zh_hant: 原廠文法無法被更名。
zh_hk: 內置語法無法重新命名。

source: Completion
cs: Dokončení
de: Vervollständigung
es: Autocompletado
fr: Complétion
it: Completamento
ja: 入力補完
ko: 완성
nl: Voltooiing
pl: Uzupełnianie
pt: Preenchimento
ru: Дополнение
tr: Tamamlama
zh_hans: 补全
zh_hant: 補全
zh_hk: 完成

source: Definition File
cs: Definiční soubor
de: Definitionsdatei
es: Archivo de definición
fr: Fichier de Définition
it: File delle definizioni
ja: 定義ファイル
ko: 정의 파일
nl: Definitie bestand
pl: Plik opisu
pt: Arquivo de Definição
ru: Файл определения
tr: Tanım Dosyası
zh_hans: 定义文件
zh_hant: 定義檔案
zh_hk: 定義檔案

source: Description
cs: Popis
de: Beschreibung
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
nl: Beschrijving
pl: Opis
pt: Descrição
ru: Описание
tr: Açıklama
zh_hans: 描述
zh_hant: 描述
zh_hk: 描述

source: Description:
cs: Popis:
de: Beschreibung:
es: Descripción:
it: Descrizione:
ja: 説明:
ko: 설명:
nl: Beschrijving:
pl: Opis:
pt: Descrição:
ru: Описание:
tr: Açıklama:
zh_hans: 描述：
zh_hant: 描述：
zh_hk: 描述：

source: Distribution URL:
cs: Distribuční adresa URL:
de: Verteilung-URL:
es: Distribuir URL:
fr: URL :
it: URL per la distribuzione:
ja: 配布URL:
ko: 배포 URL:
nl: Distributie-URL:
pl: URL dystrybucji:
pt: URL de distribuição:
ru: URL распространения:
tr: Dağıtım URL’si:
zh_hans: 发布 URL：
zh_hant: 釋出URL：
zh_hk: 發佈URL：

source: End String
cs: Koncový řetězec
de: Endzeichenkette
es: Final de la cadena
fr: Fin de chaîne
it: Fine stringa
ja: 終了文字列
ko: 끝 문자열
nl: Einde string
pl: Łańcuch zamykający
pt: String Final
ru: Конец строки
tr: Bitiş Dizisi
zh_hans: 结束字符串
zh_hant: 結束字串
zh_hk: 結尾字串

source: Entire match
cs: Celá shoda
de: Gesamter Treffer
es: Correspondencia completa
fr: Tout capturer
it: Corrispondenza completa
ja: 一致したテキスト全体
ko: 모두 일치
nl: Gehele match
pl: Całe dopasowanie
pt: Correspondência Completa
ru: Совпадение
tr: Tam eşleşme
zh_hans: 完全匹配
zh_hant: 完全匹配
zh_hk: 完全符合

source: Extensions:
cs: Přípony:
de: Suffixe:
es: Extensiones:
it: Estensioni:
ja: 拡張子:
ko: 확장:
nl: Extensies:
pl: Rozszerzenia:
pt: Extensões:
ru: Расширения:
tr: Uzantılar:
zh_hans: 扩展名：
zh_hant: 副檔名：
zh_hk: 副檔名：

source: Features
cs: Funkce
de: Funktionen
es: Recursos
fr: Fonctionnalités
it: Funzionalità
ja: 機能
ko: 기능
nl: Functies
pl: Funkcje
pt: Recursos
ru: Функции
tr: Özellikler
zh_hans: 特性
zh_hant: 特性
zh_hk: 特點

source: File Mapping
cs: Mapování souborů
de: Dateizuordnung
es: Mapeo de archivos
fr: Mappage de fichiers
it: Mappatura file
ja: ファイル関連付け
ko: 파일 매핑
nl: Mapkoppeling
pl: Mapowanie pliku
pt: Mapeamento de Arquivo
ru: Отображение файлов
tr: Dosya Eşlemleme
zh_hans: 文件关联
zh_hant: 檔案關聯
zh_hk: 檔案對應

source: Filenames:
cs: Názvy souborů:
de: Dateinamen:
es: Nombres de archivo:
fr: Noms de fichiers :
it: Nomi file:
ja: ファイル名:
ko: 파일 이름:
nl: Bestandsnamen:
pl: Nazwy plików:
pt: Nomes de arquivos:
ru: Имена файлов:
tr: Dosya Adları:
zh_hans: 文件名：
zh_hant: 檔名：
zh_hk: 檔案名稱：

source: Highlighting
cs: Zvýraznění
de: Hervorhebung
es: Resaltando
fr: Surlignage
it: Evidenziazione
ja: ハイライト
ko: 강조
nl: Markering
pl: Wyróżnianie
pt: Destaque
ru: Выделение
tr: Vurgulama
zh_hans: 高亮显示
zh_hant: 高亮顯示
zh_hk: 重點標示

source: IC
cs: IV
pt: IM
tr: BY

source: If not specified, syntax completion words are generated based on the highlighting settings.
cs: Pokud není zadáno, jsou slova pro dokončení syntaxe generována na základě nastavení zvýraznění.
de: Wenn nichts angegeben ist, werden die Vervollständigungswörter für den Syntax aus den Einstellungen für das Hervorheben erstellt.
es: Si no se encuentra la palabra, la lista final se generará de los ajustes de coloración.
fr: Si non précisé, les mots de complétion de syntaxe sont générés à partir des paramètres de surlignage.
it: Quando non specificato, la sintassi delle parole di completamento è generata in base ai parametri evidenziati.
ja: 設定がないときは、ハイライト設定からシンタックス補完単語が生成されます。
ko: 지정되지 않으면, 구문 완성 단어는 강조 설정으로부터 생성됩니다.
nl: Als dit niet wordt opgegeven, worden woorden ter aanvulling van de syntaxis gegenereerd op basis van de instellingen voor markeren.
pl: Jeśli nie określono, uzupełniane wyrazy składni generowane są na podstawie ustawień wyróżniania.
pt: Se não especificado, as palavras de conclusão de sintaxe são geradas com base nas configurações de destaque.
ru: Если не указано иное, слова для завершения синтаксиса генерируются на основе настроек подсветки.
tr: Belirtilmemişse sözdizim tamamlama sözcükleri vurgulama ayarları tabanlı olarak üretilir.
zh_hans: 如果未指定，则基于高亮设置生成语法补全词。
zh_hant: 如果未指定，則基於高亮設定生成語法補全用詞。
zh_hk: 如未指定，語法完成字詞將依重點標示設定產生。

source: Ignore Case
cs: Ignorovat velikost písmen
de: Groß-/Kleinschreibung ignorieren
es: Ignorar mayúsculas y minúsculas
fr: Ignorer la casse
it: Ignora maiuscole/minuscole
ja: 大文字/小文字を無視
ko: 대소문자 무시
nl: Negeer hoofdletters
pl: Ignoruj wielkość liter
pt: Ignorar Maiúsculas/Minúsculas
ru: Игнорировать регистр
tr: Harf Biçimini Yok Say
zh_hans: 忽略大小写
zh_hant: 忽略大小寫
zh_hk: 忽略大小寫

source: Information
cs: Informace
de: Informationen
es: Información
fr: Informations
it: informazioni
ja: 情報
ko: 정보
nl: Informatie
pl: Informacje
pt: Informações
ru: Информация
tr: Bilgiler
zh_hans: 信息
zh_hant: 資訊
zh_hk: 資料

source: Inline comment:
cs: Řádkový komentář:
de: Inline-Kommentar:
es: Comentario de línea:
fr: Commentaire de ligne :
it: Commento in linea:
ja: インラインコメント:
ko: 인라인 주석:
nl: Inline-opmerkingen:
pl: Komentarz wierszowy:
pt: Comentário incorporado:
ru: Встроенный комментарий:
tr: Satır içi yorum:
zh_hans: 行注释：
zh_hant: 行註釋：
zh_hk: 內文註解：

source: Interpreters:
cs: Interpretery:
de: Interpreter:
es: Intérpretes:
fr: Interpréteurs :
it: Interpreti:
ja: インタープリタ:
ko: 인터프리터:
pl: Interpretery:
pt: Intérpretes:
ru: Переводчики:
tr: Yorumlayıcılar:
zh_hans: 解释器：
zh_hant: 直譯器：
zh_hk: 解讀器：

source: Kind
cs: Druh
de: Art
es: Clase
fr: Type
it: Tipo
ja: 種類
ko: 종류
nl: Soort
pl: Rodzaj
ru: Тип
tr: Tür
zh_hans: 类型
zh_hant: 種類
zh_hk: 種類

source: Kind:
cs: Druh:
de: Art:
es: Clase:
fr: Type :
it: Tipo:
ja: 種類:
ko: 종류:
nl: Soort:
pl: Rodzaj:
ru: Тип:
tr: Tür:
zh_hans: 类型：
zh_hant: 種類：
zh_hk: 種類：

source: Last Modified:
cs: Poslední změna:
de: Zuletzt geändert:
es: Última modificación:
fr: Dernière modification :
it: Ultima modifica:
ja: 最終更新日:
ko: 수정된 날짜:
nl: Laatst gewijzigd:
pl: Ostatnio modyfikowany:
pt: Última modificação:
ru: Последнее изменение:
tr: Son değiştirilme:
zh_hans: 最后更新：
zh_hant: 最後更新：
zh_hk: 上次修改時間：

source: License:
cs: Licence:
de: Lizenz:
es: Licencia:
it: Licenza:
ja: ライセンス:
ko: 사용권 계약:
nl: Licentie:
pl: Licencja:
pt: Licença:
ru: Лицензия:
tr: Lisans:
zh_hans: 许可证：
zh_hant: 許可證：
zh_hk: 許可證：

source: No error found.
cs: Nebyla nalezena žádná chyba.
de: Keinen Fehler gefunden.
es: No se encontró ningún error.
fr: Aucune erreur trouvée.
it: Nessun errore rilevato.
ja: エラーは検出されませんでした。
ko: 발견된 오류 없음.
nl: Geen fout gevonden.
pl: Nie znaleziono błędów.
pt: Nenhum erro encontrado.
ru: Ошибок не найдено
tr: Hata bulunamadı.
zh_hans: 没有发现错误。
zh_hant: 沒有發現錯誤。
zh_hk: 未找到錯誤。

source: None
cs: Žádný
de: Ohne
es: Nada
fr: Aucun
it: Nessuno
ja: なし
ko: 없음
nl: Geen
pl: Brak
pt: Nenhum
tr: Hiçbiri
zh_hans: 无
zh_hant: 無
zh_hk: 無

source: RE
cs: RV
pt: ER
tr: BY

source: Regular Expression
cs: Regulární výraz
de: Regulärer Ausdruck
es: Expresión regular
fr: Expressions régulières
it: Espressione regolare
ja: 正規表現
ko: 정규표현식
nl: Reguliere expressie
pl: Wyrażenie regularne
pt: Expressão Regular
ru: Регулярное значение
tr: Düzenli İfade
zh_hans: 正则表达式
zh_hant: 常規表示式
zh_hk: 常規表示式

source: Regular Expression Pattern
cs: Vzor regulárního výrazu
de: Muster des reguläreren Ausdrucks
es: Patrón de expresión regular
fr: Expression régulière
it: Espressione regolare
ja: 正規表現パターン
ko: 정규표현식
nl: Regulier expressiepatroon
pl: Wzorzec wyrażenia regularnego
pt: Padrão de Expressão Regular
ru: Шаблон регулярного значения
tr: Düzenli İfade Dizgisi
zh_hans: 正则表达式
zh_hant: 常規表示式
zh_hk: 常規表示式模式

source: Syntax name
cs: Název syntaxe
es: Nombre de sintaxis
fr: Nom de la syntaxe
it: Nome sintassi
ja: シンタックス名
ko: 구문 이름
nl: Syntaxisnaam
pl: Nazwa składni
pt: Nome da sintaxe
ru: Название синтаксиса
tr: Sözdizim Adı
zh_hans: 语法名
zh_hant: 文法名
zh_hk: 語法名稱

# Syntax.Error.Code.blockComment
source: Block comment needs both begin and end delimiters.
cs: Blokové komentáře vyžadují počáteční i koncový řetězec.
de: Block-Kommentare brauchen sowohl Anfangs- als auch Endzeichenkette.
es: El comentario de bloque necesita tanto el delimitador inicial como el delimitador final.
fr: Les commentaires en bloc ont besoin d’un délimiteur de début et de fin.
it: Un blocco di commento richiede un delimitatore iniziale ed uno finale.
ja: ブロックコメントは開始と終了の両方の文字列が必要です。
ko: 주석 블록은 시작과 끝 구분자 모두 필요합니다.
nl: Blokcommentaren hebben zowel begin- als eindbegrenzers nodig.
pl: Komentarz blokowy wymaga ograniczników początku i końca.
pt: Comentários em bloco precisam ter delimitadores inicial e final.
ru: Блок комментариев должен содержать как начальный, так и конечный разделители.
tr: Blok yorumlar hem başlangıç hem bitiş sınırlayıcısı gerektirir.
zh_hans: 塊註釋需要同時有起始分界符和終止分界符。
zh_hant: 塊註釋需要同時有起始符號和終止符號。
zh_hk: 區塊註解需要開頭與結尾分隔符號。

# Syntax.Error.Code.duplicated
source: The same word is registered multiple times.
cs: Stejné slovo je registrováno vícekrát.
de: Mehrfach registriert.
es: La misma palabra se registra varias veces.
fr: Le même mot est présent plusieurs fois.
it: La stessa parola risulta registrata più volte.
ja: 登録が重複しています。
ko: 같은 단어가 여러번 등록됨.
nl: Hetzelfde woord wordt meerdere keren geregistreerd.
pl: Ten sam wyraz jest rejestrowany wielokrotnie.
pt: A mesma palavra está registrada várias vezes.
ru: Одно и то же слово зарегистрировано несколько раз.
tr: Aynı sözcük birden çok kez kayıt edilmiş.
zh_hans: 重复注册。
zh_hant: 重複註冊。
zh_hk: 同一個字詞已被註冊多次。

# Syntax.Error.Code.regularExpression
source: Invalid regular expression.
cs: Neplatný regulární výraz.
de: Ungültiger regulärer Ausdruck.
es: Expresión regular no válida.
fr: Expression régulière invalide.
it: Espressione regolare non valida.
ja: 無効な正規表現です。
ko: 유효하지 않은 정규표현식.
nl: Ongeldige reguliere expressie.
pl: Niepoprawne wyrażenie regularne.
pt: Expressão regular inválida.
ru: Неверное регулярное выражение.
tr: Geçersiz düzenli ifade.
zh_hans: 无效的正则表达式。
zh_hant: 無效的常規表示式。
zh_hk: 無效的常規表示式。

# Syntax.key.completions.label
source: Completion
cs: Dokončení
de: Vervollständigung
es: Completado
fr: Complétion
it: Completamento
ja: 入力補完
ko: 완성
nl: Voltooiing
pl: Uzupełnienie
pt: Conclusão
ru: Дополнения
tr: Tamamlama
zh_hans: 补全
zh_hant: 補全
zh_hk: 完成

# Syntax.key.outlines.label
source: Outline
cs: Osnova
de: Gliederung
es: Esquema
fr: Structure
ja: アウトライン
ko: 개요
nl: Contour
pl: Konspekt
pt: Plano
ru: Структура
tr: Ana Hat
zh_hans: 大纲
zh_hant: 大綱
zh_hk: 大綱

source: The interpreters are used to determine the syntax from the #! header in the document.
cs: Interpretery se používají k určení syntaxe z hlavičky #! v dokumentu.
de: Die Interpreter werden benutzt, um die Syntax vom #!-Header im Dokument zu bestimmen.
it: Gli interpreti sono usati per determinare la sintassi in base all'intestazione #! header del documento.
ja: インタープリタは書類内の#!ヘッダからシンタックスを特定するときに使用されます。
ko: 인터프리터는 문서의 #! 헤더에서 구문을 판별하는 데 사용됩니다.
pl: Interpretery są wykorzystywane do wykrycia składni na podstawie nagłówka #! w dokumencie.
pt: Os interpretadores são usados para determinar o estilo da sintaxe a partir do cabeçalho #! do documento.
ru: Интерпретаторы используются для определения синтаксиса из заголовка #! в документе.
tr: Yorumlayıcılar, belgedeki #! üstbilgisinden sözdizimi belirlemek için kullanılır.
zh_hans: 解释器被用于根据文档中的“#!”标头判断语法。
zh_hant: 解譯器用於根據文件中#!標頭確定文法。
zh_hk: 解譯器用於在文件中透過「#!」確定語法的標頭。

source: Validation
cs: Ověření
de: Validierung
es: Validación
it: Validazione
ja: 検証
ko: 검증
nl: Validatie
pl: Poprawność
pt: Validação
ru: Проверка
tr: Doğrulama
zh_hans: 验证
zh_hant: 驗證
zh_hk: 驗證

source: Version:
cs: Verze:
es: Versión:
it: Versione:
ja: バージョン:
ko: 버전:
nl: Versie:
pl: Wersja:
pt: Versão:
ru: Версия:
tr: Sürüm:
zh_hans: 版本：
zh_hant: 版本：
zh_hk: 版本：

source: Built-in
de: Integriert
ja: 内蔵

source: Display Pattern
de: Anzeigemuster
ja: 表示パターン

source: Line Start Only
de: Nur am Zeilenanfang
ja: 行頭のみ

source: Managed by the app
de: Von der App verwaltet
ja: アプリによる管理

source: Multiline
de: Mehrere Zeilen
ja: 複数行
zh_hans: 多行
zh_hant: 多行
zh_hk: 多行

# Syntax.key.commentDelimiters.label
source: Commenting
de: Kommentieren
ja: コメント記号

# SyntaxBuiltInView.description
source: This language uses a structure-based, general-purpose parser called tree-sitter for syntax analysis. Because the extraction rules are managed by the app, you can’t customize them.
de: Diese Sprache verwendet für die Syntaxanalyse einen struktur­basierten, allgemeinen Parser namens tree-sitter.\nDa die Extraktionsregeln von der App verwaltet werden, kannst du sie nicht anpassen.
ja: この言語のシンタックス解析には、tree-sitterという構造ベースの汎用パーサを使っています。\n抽出ルールはアプリによって管理されているため、カスタマイズはできません。

source: The comment delimiters defined here are used for syntax highlighting as well.
de: Die hier definierten Kommentar-Trennzeichen werden auch für die Syntaxhervorhebung verwendet.
ja: ここで定義したコメント記号はシンタックスハイライトにも使用されます。

source: The first delimiter is used for commenting out.
de: Das erste Trennzeichen wird zum Auskommentieren verwendet.
ja: 最初の記号がコメントアウトに使われます。

source: Type
de: Typ
ja: タイプ
